<a href="https://colab.research.google.com/github/Nutritiousfacts/DS-Unit-1-Sprint-1-Dealing-With-Data/blob/master/module1-join-and-reshape-data/Gabe_Flomo_LS_DS_121_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

_Lambda School Data Science_

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-08-13 04:42:30--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.9.205
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.9.205|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.5’

instacart_online_gr 100%[===================>] 196.03M  47.3MB/s    in 4.7s

2019-08-13 04:42:35 (42.0 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.5’ saved [205548478/205548478]

In [0]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [0]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [0]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [0]:
##### YOUR CODE HERE #####
import pandas as pd

orders = pd.read_csv('orders.csv')
opp = pd.read_csv('order_products__prior.csv')
products = pd.read_csv('products.csv')
opt = pd.read_csv('order_products__train.csv')
order_products = pd.concat([opp, opt])

opt.head()

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [0]:
orders.head()

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [0]:
print(products.shape)
products.head()

(49688, 4)

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [0]:
all_orders = orders['order_number']
print(all_orders.shape)
all_orders.head()

(3421083,)

0    1
1    2
2    3
3    4
4    5
Name: order_number, dtype: int64

In [0]:
product_ids = products['product_id']
print(product_ids.shape)
product_ids.head()

(49688,)

0    1
1    2
2    3
3    4
4    5
Name: product_id, dtype: int64

In [0]:
names = products['product_name']
print(names.shape)
names.head()

(49688,)

0                           Chocolate Sandwich Cookies
1                                     All-Seasons Salt
2                 Robust Golden Unsweetened Oolong Tea
3    Smart Ones Classic Favorites Mini Rigatoni Wit...
4                            Green Chile Anytime Sauce
Name: product_name, dtype: object

In [0]:
columns = ['order_id', 'product_id']
print(order_products.shape)
order_products[columns].head()

(33819106, 4)

   order_id  product_id
0         2       33120
1         2       28985
2         2        9327
3         2       45918
4         2       30035

In [0]:
merged = pd.merge(products,order_products[columns],on = 'product_id')
merged

          product_id                product_name  ...  department_id  order_id
0                  1  Chocolate Sandwich Cookies  ...             19      1107
1                  1  Chocolate Sandwich Cookies  ...             19      5319
2                  1  Chocolate Sandwich Cookies  ...             19      7540
3                  1  Chocolate Sandwich Cookies  ...             19      9228
4                  1  Chocolate Sandwich Cookies  ...             19      9273
5                  1  Chocolate Sandwich Cookies  ...             19      9696
6                  1  Chocolate Sandwich Cookies  ...             19     11140
7                  1  Chocolate Sandwich Cookies  ...             19     11485
8                  1  Chocolate Sandwich Cookies  ...             19     12672
9                  1  Chocolate Sandwich Cookies  ...             19     13668
10                 1  Chocolate Sandwich Cookies  ...             19     14668
11                 1  Chocolate Sandwich Cookies  ...             19     16132
12                 1  Chocolate Sandwich Cookies  ...             19     18303
13                 1  Chocolate Sandwich Cookies  ...             19     19479
14                 1  Chocolate Sandwich Cookies  ...             19     19569
15                 1  Chocolate Sandwich Cookies  ...             19     19879
16                 1  Chocolate Sandwich Cookies  ...             19     19939
17                 1  Chocolate Sandwich Cookies  ...             19     19989
18                 1  Chocolate Sandwich Cookies  ...             19     23202
19                 1  Chocolate Sandwich Cookies  ...             19     24367
20                 1  Chocolate Sandwich Cookies  ...             19     24760
21                 1  Chocolate Sandwich Cookies  ...             19     25365
22                 1  Chocolate Sandwich Cookies  ...             19     26490
23                 1  Chocolate Sandwich Cookies  ...             19     29334
24                 1  Chocolate Sandwich Cookies  ...             19     33675
25                 1  Chocolate Sandwich Cookies  ...             19     34340
26                 1  Chocolate Sandwich Cookies  ...             19     38255
27                 1  Chocolate Sandwich Cookies  ...             19     38944
28                 1  Chocolate Sandwich Cookies  ...             19     43669
29                 1  Chocolate Sandwich Cookies  ...             19     44326
...              ...                         ...  ...            ...       ...
33819076       49688      Fresh Foaming Cleanser  ...             11   2454083
33819077       49688      Fresh Foaming Cleanser  ...             11   2476113
33819078       49688      Fresh Foaming Cleanser  ...             11   2498014
33819079       49688      Fresh Foaming Cleanser  ...             11   2530161
33819080       49688      Fresh Foaming Cleanser  ...             11   2604681
33819081       49688      Fresh Foaming Cleanser  ...             11   2664187
33819082       49688      Fresh Foaming Cleanser  ...             11   2710528
33819083       49688      Fresh Foaming Cleanser  ...             11   2720169
33819084       49688      Fresh Foaming Cleanser  ...             11   2732438
33819085       49688      Fresh Foaming Cleanser  ...             11   2744037
33819086       49688      Fresh Foaming Cleanser  ...             11   2779979
33819087       49688      Fresh Foaming Cleanser  ...             11   2844538
33819088       49688      Fresh Foaming Cleanser  ...             11   2865928
33819089       49688      Fresh Foaming Cleanser  ...             11   2932449
33819090       49688      Fresh Foaming Cleanser  ...             11   2951582
33819091       49688      Fresh Foaming Cleanser  ...             11   2996443
33819092       49688      Fresh Foaming Cleanser  ...             11   3008450
33819093       49688      Fresh Foaming Cleanser  ...             11   3041952
33819094       49688      Fresh Foaming Cleanser  ...             11   3043332
33819095       49688      Fresh Foaming Cleanser  ...             11   3058519
33819096       49688      Fresh Foaming Cleanser  ...             11   3106363
33819097       49688      Fresh Foaming Cleanser  ...             11   3111954
33819098       49688      Fresh Foaming Cleanser  ...             11   3122003
33819099       49688      Fresh Foaming Cleanser  ...             11   3166828
33819100       49688      Fresh Foaming Cleanser  ...             11   3290206
33819101       49688      Fresh Foaming Cleanser  ...             11   3401313
33819102       49688      Fresh Foaming Cleanser  ...             11    655800
33819103       49688      Fresh Foaming Cleanser  ...             11   2198380
33819104       49688      Fresh Foaming Cleanser  ...             11   2508423
33819105       49688      Fresh Foaming Cleanser  ...             11   2986153

[33819106 rows x 5 columns]

In [0]:
names = ['Banana',
'Bag of Organic Bananas',
'Organic Strawberries',
'Organic Baby Spinach',
'Organic Hass Avocado',
'Organic Avocado',
'Large Lemon',
'Strawberries',
'Limes',
'Organic Whole Milk']

quantity = []
for item in names:
  quantity.append((merged['product_name']== item).sum())

for i in range(len(names)):
  print('there were',quantity[i],names[i])

there were 491291 Banana
there were 394930 Bag of Organic Bananas
there were 275577 Organic Strawberries
there were 251705 Organic Baby Spinach
there were 220877 Organic Hass Avocado
there were 184224 Organic Avocado
there were 160792 Large Lemon
there were 149445 Strawberries
there were 146660 Limes
there were 142813 Organic Whole Milk

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
%matplotlib inline
import pandas as pd
import numpy as np
import seaborn as sns

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

In [3]:
table1

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

In [4]:
table1.T

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [5]:
table1.columns.to_list()

['treatmenta', 'treatmentb']

In [6]:
table1.index.to_list()

['John Smith', 'Jane Doe', 'Mary Johnson']

In [7]:
table1 = table1.reset_index()
table1

          index  treatmenta  treatmentb
0    John Smith         NaN           2
1      Jane Doe        16.0          11
2  Mary Johnson         3.0           1

In [8]:
table1.index.to_list()

[0, 1, 2]

In [9]:
tidy = table1.melt(id_vars='index')
tidy = table1.melt(id_vars='index', value_vars=['treatmenta', 'treatmentb'])
tidy

          index    variable  value
0    John Smith  treatmenta    NaN
1      Jane Doe  treatmenta   16.0
2  Mary Johnson  treatmenta    3.0
3    John Smith  treatmentb    2.0
4      Jane Doe  treatmentb   11.0
5  Mary Johnson  treatmentb    1.0

In [10]:
tidy = tidy.rename(columns={
    'index': 'name', 
    'variable': 'trt', 
    'value': 'result'
})

tidy

           name         trt  result
0    John Smith  treatmenta     NaN
1      Jane Doe  treatmenta    16.0
2  Mary Johnson  treatmenta     3.0
3    John Smith  treatmentb     2.0
4      Jane Doe  treatmentb    11.0
5  Mary Johnson  treatmentb     1.0

In [11]:
tidy.trt = tidy.trt.str.replace('treatment', '')

tidy

           name trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

In [13]:
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [0]:
table2 = table2.reset_index()

In [17]:
tidy2 = table2.melt(id_vars = 'index', value_vars = ['John Smith', 'Jane Doe','Mary Johnson'])
tidy2

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [18]:
tidy2.pivot_table(index = 'variable',columns = 'index',values = 'value')

index         treatmenta  treatmentb
variable
Jane Doe            16.0        11.0
John Smith           NaN         2.0
Mary Johnson         3.0         1.0

In [0]:
flights = sns.load_dataset('flights')

In [22]:
##### YOUR CODE HERE #####
flights.head()

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [24]:
pivot = flights.pivot(index = 'year',columns = 'month', values = 'passengers')
pivot

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####